---
type: ElectricalLoadAreaData
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 3
tags: [revit-api, class]
---

# ElectricalLoadAreaData

`Autodesk.Revit.DB.Electrical.ElectricalLoadAreaData` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | CreateElectricalLoadAreas | 2023 | `public static ISet < ElementId > CreateElectricalLoadAreas ( Document doc , ElementId levelId , ElementId phaseId )` |
| Method | GetAreaBasedLoadIds | 2023 | `public ISet < ElementId > GetAreaBasedLoadIds ()` |
| Method | HasCircuitsWithoutElectricalLoadAreas | 2023 | `public static bool HasCircuitsWithoutElectricalLoadAreas ( Document doc , ElementId levelId , ElementId phaseId )` |